Belief997/lab-Micro_power_consumption_backscatter/KinetisSDK/examples/frdmkl03z/demo_apps/power_manager_hal_demo/main.c
/*******************************  user func begin *********************************************/

#define __FILENAME__ (strrchr(__FILE__, '/') ? (strrchr(__FILE__, '/') + 1):__FILE__)

#define LOG_DEBUG(fmt, ...) PRINTF("[D][%s:%d %s]"fmt"\r\n", __FILENAME__, __LINE__, __FUNCTION__, ##__VA_ARGS__);

#define GET_MODE_INDEX(mode) ((mode) - kDemoMin - 1)

// initializes configuration structures
#define INIT_MODE_CONFIG(SetMode) {.mode = SetMode, .sleepOnExitValue = false,}

enum
{
    WakeUp_rtc = 0,
    WakeUp_btn = 1,

};



void user_PrintMenu(void)
{
    PRINTF("\r\nSelect the desired operation \r\n\r\n");
    PRINTF("Press  %c for enter: RUN   - Normal RUN mode\r\n",kDemoRun);
    PRINTF("Press  %c for enter: Wait  - Wait mode\r\n",kDemoWait);
    PRINTF("Press  %c for enter: Stop  - Stop mode\r\n",kDemoStop);
    PRINTF("Press  %c for enter: VLPR  - Very Low Power Run mode\r\n",kDemoVlpr);
    PRINTF("Press  %c for enter: VLPW  - Very Low Power Wait mode\r\n",kDemoVlpw);
    PRINTF("Press  %c for enter: VLPS  - Very Low Power Stop mode\r\n",kDemoVlps);
    PRINTF("Press  %c for enter: VLLS0 - Very Low Leakage Stop 0 mode\r\n",kDemoVlls0);
    
    PRINTF("Press  %c for enter: VLLS1 - Very Low Leakage Stop 1 mode\r\n",kDemoVlls1);
    PRINTF("Press  %c for enter: VLLS3 - Very Low Leakage Stop 3 mode\r\n",kDemoVlls3);
    
    PRINTF("\r\nWaiting for key press..\r\n\r\n");
}

void user_initRTC(void)
{
    rtc_datetime_t date =
    {
        .year = 2014U, .month = 4U, .day = 30U,
        .hour = 14U, .minute = 0U, .second = 0U,
    };

    // select the 1Hz for RTC_CLKOUT
    CLOCK_SYS_SetRtcOutSrc(kClockRtcoutSrc1Hz);
    /* Enable clock gate to RTC module */
    CLOCK_SYS_EnableRtcClock( 0U);
    /* Initialize the general configuration for RTC module.*/
    // clear all interrupts and resets the RTC
    RTC_HAL_Init(RTC_BASE_PTR);
    BOARD_InitRtcOsc();

    /* Enable the RTC Clock output */
    RTC_HAL_SetClockOutCmd(RTC_BASE_PTR, true);

    NVIC_ClearPendingIRQ(RTC_IRQn);

    INT_SYS_EnableIRQ(RTC_IRQn);

    RTC_HAL_SetDatetime(RTC_BASE_PTR, &date);
}

void user_delayTemp(void)
{
    LOG_DEBUG("delay...");
    uint32_t cnt = 0;
    while(++cnt < 99999);
    LOG_DEBUG("CNT %d", cnt);
    cnt = 0;
}

void user_showState(void)
{
    uint32_t freq = 0;
    CLOCK_SYS_GetFreq(kCoreClock, &freq);
    PRINTF("    Core Clock = %dHz \r\n", freq);
    displayPowerMode();
}




int user_SetGpio(uint32_t pinName, uint32_t value)
{
    /* Get actual port and pin number.*/
    uint32_t port = GPIO_EXTRACT_PORT(pinName);
    uint32_t pin = GPIO_EXTRACT_PIN(pinName);
    GPIO_Type * gpioBase = g_gpioBase[port];
    PORT_Type * portBase = g_portBase[port];

    GPIO_HAL_WritePinOutput(gpioBase, pin, value);
    return 0;
}










int user_test(void)
{
    user_SetGpio(kGpioLED1, 0);


    return 0;
}


/*******************************  user func end *********************************************/


/*!
 * @brief main demo function.
 */
int main(void) {
    power_manager_error_code_t ret = kPowerManagerSuccess;

    // 各个低功耗模式配置
    // Example of constant configuration
    // It may save the space in RAM
    const power_manager_user_config_t vlprConfig = INIT_MODE_CONFIG(kPowerManagerVlpr);
    power_manager_user_config_t vlpwConfig     = INIT_MODE_CONFIG(kPowerManagerVlpw);
    // VLLS0 mode is supported only by some SOCs.
    power_manager_user_config_t vlls0Config    = INIT_MODE_CONFIG(kPowerManagerVlls0);   
    power_manager_user_config_t vlls1Config    = INIT_MODE_CONFIG(kPowerManagerVlls1);   
    power_manager_user_config_t vlls3Config    = INIT_MODE_CONFIG(kPowerManagerVlls3);   
    power_manager_user_config_t vlpsConfig     = INIT_MODE_CONFIG(kPowerManagerVlps);   
    power_manager_user_config_t waitConfig     = INIT_MODE_CONFIG(kPowerManagerWait);   
    power_manager_user_config_t stopConfig     = INIT_MODE_CONFIG(kPowerManagerStop);   
    power_manager_user_config_t runConfig      = INIT_MODE_CONFIG(kPowerManagerRun);   
    // Initializes array of pointers to power manager configurations
    power_manager_user_config_t const *powerConfigs[] =
    {
      &runConfig,
      &waitConfig,
      &stopConfig,
      &vlprConfig,
      &vlpwConfig,
      &vlpsConfig,
      &vlls0Config,
      &vlls1Config,
      &vlls3Config,
    };
    
    // User callback data
    user_callback_data_t callbackData0 = {0};

    // Initializes callback configuration structure for power manager
    power_manager_callback_user_config_t callbackCfg0 = { callback0,
        kPowerManagerCallbackBeforeAfter,
        (power_manager_callback_data_t*) &callbackData0 };

    // Initializes array of pointers to power manager callbacks
    power_manager_callback_user_config_t * callbacks[] =
    { &callbackCfg0 };


    // Initializes hardware
    hardware_init();
    // Initializes OS abstraction layer which uses LPTMR HAL layer
    OSA_Init();

    // Make the current Clock Manager mode configuration 1 (default configuration)
    /* Set clock configurations to clock manager. */
    CLOCK_SYS_Init(g_defaultClockConfigurations, CLOCK_NUMBER_OF_CONFIGURATIONS,
                   clockCallbackTable, ARRAY_SIZE(clockCallbackTable));

    // Action: set clock 
    CLOCK_SYS_UpdateConfiguration(CLOCK_RUN, kClockManagerPolicyForcible);

//    user_initRTC();

   // Initializes GPIO driver for LEDs and buttons
    GPIO_DRV_Init(switchPins, ledPins);

    // initialize power manager driver
    POWER_SYS_Init(powerConfigs, ARRAY_SIZE(powerConfigs), callbacks, ARRAY_SIZE(callbacks));

    // Enables LLWU interrupt
    INT_SYS_EnableIRQ(LLWU_IRQn);





    PRINTF("\r\n###########  Power Manager Demo @ %s %s ###########\r\n\r\n", __DATE__, __TIME__);
    user_showState();

    // enter VLPR default
    LOG_DEBUG("enter VLPR");
    if(kPowerManagerVlpr != POWER_SYS_GetCurrentMode())
    {
        update_clock_mode(CLOCK_VLPR);
        PRINTF("Entering Very Low Power Run mode\r\n");
        ret = POWER_SYS_SetMode(GET_MODE_INDEX(kDemoVlpr), kPowerManagerPolicyAgreement);
        CHECK_RET_VAL(ret, GET_MODE_INDEX(kDemoVlpr));
    }
    else
    {
        PRINTF("Very Low Power Run mode already active\r\n");
    }

    user_test();
    
