Belief997/lab-Micro_power_consumption_backscatter/KinetisSDK/examples/frdmkl03z/demo_apps/power_manager_hal_demo/main.c
    // a little delay
    user_delayTemp();


    while (1)
    {
        user_showState();
//        user_PrintMenu();

        LOG_DEBUG("State change: VLPR -> VLLS3");

        // Into VLLS3 deep sleep
        {
            LOG_DEBUG("ENTER VLLS3!");
            // 0:rtc, 1:btn
//            setWakeUpSource(selectWakeUpSource(testVal),"Very Low Leakage Stop 3 mode");
            // set btn(sw2) gpio int as wake source
            setWakeUpSource(WakeUp_btn, "Very Low Leakage Stop 3 mode");
            PRINTF("Wake up goes through Reset sequence.\r\n");
            ret = POWER_SYS_SetMode(GET_MODE_INDEX(kDemoVlls3), kPowerManagerPolicyAgreement);
            CHECK_RET_VAL(ret, GET_MODE_INDEX(kDemoVlls3));
            
            LOG_DEBUG("Sleep Fail!!");
        }



        // demo logic for reference
//        {
//        demo_power_modes_t testVal = kDemoRun;
//        // Wait for user response
//        testVal = (demo_power_modes_t)GETCHAR();

//        if ((testVal >= 'a') && (testVal <= 'z'))
//        {
//            testVal -= 'a' - 'A';
//        }

//        if (testVal > kDemoMin && testVal < kDemoMax)
//        {

//            mode = testVal - kDemoMin - 1;

//            switch (testVal)
//            {
//                case kDemoWait:
//                    if (POWER_SYS_GetCurrentMode() == kPowerManagerVlpr)
//                    {
//                        PRINTF("Can not go from VLPR to WAIT directly\r\n");
//                        break;
//                    }
//                    setWakeUpSource(selectWakeUpSource(testVal),"Wait mode");

//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);

//                    break;

//                case kDemoStop:
//                    if (POWER_SYS_GetCurrentMode() == kPowerManagerVlpr)
//                    {
//                        PRINTF("Can not go from VLPR to STOP directly\r\n");
//                        break;
//                    }
//                    setWakeUpSource(selectWakeUpSource(testVal),"Stop mode");

//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);

//                    CHECK_RET_VAL(ret, mode);

//                    // update Clock Mode
//                    update_clock_mode(CLOCK_RUN);
//                    break; 

//                case kDemoVlpr:
//                    if(kPowerManagerVlpr != POWER_SYS_GetCurrentMode())
//                    {
//                        update_clock_mode(CLOCK_VLPR);
//                        PRINTF("Entering Very Low Power Run mode\r\n");
//                        ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                        CHECK_RET_VAL(ret, mode);
//                    }
//                    else
//                    {
//                        PRINTF("Very Low Power Run mode already active\r\n");
//                    }
//                    break;

//                case kDemoVlpw:
//                    if (POWER_SYS_GetCurrentMode() == kPowerManagerRun)
//                    {
//                        PRINTF("Can not go from RUN to VLPW directly\r\n");
//                        break;
//                    }
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Wait mode");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);
//                    break;

//                case kDemoVlps:
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Power Stop mode");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);

//                    if (POWER_SYS_GetCurrentMode() == kPowerManagerRun)
//                    {
//                        // update Clock Mode to Run
//                        update_clock_mode(CLOCK_RUN);
//                    }

//                    CHECK_RET_VAL(ret, mode);
//                    break;
//                case kDemoVlls0:
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Leakage Stop 0 mode");
//                    PRINTF("Wake up goes through Reset sequence.\r\n");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);

//                    break;
//                case kDemoVlls1:
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Leakage Stop 1 mode");
//                    PRINTF("Wake up goes through Reset sequence.\r\n");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);
//                    break;

//                case kDemoVlls3:
//                    setWakeUpSource(selectWakeUpSource(testVal),"Very Low Leakage Stop 3 mode");
//                    PRINTF("Wake up goes through Reset sequence.\r\n");
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);
//                    CHECK_RET_VAL(ret, mode);

//                    break;

//                case kDemoRun:
//                    ret = POWER_SYS_SetMode(mode, kPowerManagerPolicyAgreement);

//                    if (ret != kPowerManagerSuccess)
//                    {
//                        PRINTF("POWER_SYS_SetMode(%u) returned unexpected status : %u\r\n",mode,ret);
//                    }
//                    else
//                    {
//                        update_clock_mode(CLOCK_RUN);
//                    }
//                    break;
//                default:
//                    PRINTF("Wrong value");
//                    break;
//            }
//            PRINTF("\r\nNext loop\r\n");
//        }
//        }

    }
}

///////////////////////////////////////////////////////////////////////////////
// EOF
///////////////////////////////////////////////////////////////////////////////
